In [1]:
import pandas as pd

In [7]:
data=pd.read_excel(r"D:\DS_NIT\Oct_24\Pandas\TASK -- convert raw data - clean data.xlsx")

In [8]:
data

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,NaN,THIS IS NOT CLEAN DATA,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,ADDR,DT,NAME,time,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,"45 rd, kenith street, btm, bangalore 500038",2022-04-03 00:00:00,abc,8:30:21,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,"45 rd, street, hitech, Hd 500038",2022-04-02 00:00:00,dec,5:30:21,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,THIS IS CLEAN DATA,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,House add,street,city,state,zip,month,data,year,name,hr,min,sec
8,NaN,NaN,45 rd,kenith,btm,banga,50038,3,4,2022,abc,8,30,21

In [5]:
##by this we cannot extract clean data

In [25]:
raw_data={
    "ADDR":['45 rd, kenith street, btm, bangalore, 500038',
		'45 rd,  street, hitech, Hd, 500038'],
    "DT":['4/3/2022','4/2/2022'],
    "NAME":['abc', 'dec'],
    "time":["8:30:21","5:30:21"]
}

df=pd.DataFrame(raw_data)
print(df)

                                           ADDR        DT NAME     time
0  45 rd, kenith street, btm, bangalore, 500038  4/3/2022  abc  8:30:21
1            45 rd,  street, hitech, Hd, 500038  4/2/2022  dec  5:30:21

In [16]:
addr_s=df.ADDR.str.split(',',expand=True)
addr_s

       0               1        2           3        4
0  45 rd   kenith street      btm   bangalore   500038
1  45 rd          street   hitech          Hd   500038

In [28]:
df

,ADDR,DT,NAME,time,House Add
0,"45 rd, kenith street, btm, bangalore, 500038",4/3/2022,abc,8:30:21,45 rd
1,"45 rd, street, hitech, Hd, 500038",4/2/2022,dec,5:30:21,45 rd

In [36]:
df['H.No']=addr_s[0]
df['H.No']

0    45 rd
1    45 rd
Name: H.No, dtype: object

In [32]:
#House address having h.no, street,city,state,zipcode

In [37]:
df['Street']=addr_s[1]
df['Street']

0     kenith street
1            street
Name: Street, dtype: object

In [38]:
df['City']=addr_s[2]
df['City']

0        btm
1     hitech
Name: City, dtype: object

In [39]:
df['State']=addr_s[3]
df['State']

0     bangalore
1            Hd
Name: State, dtype: object

In [40]:
df['Zipcode']=addr_s[4]
df['Zipcode']

0     500038
1     500038
Name: Zipcode, dtype: object

In [41]:
#DAte we can convert it as day,month,year

In [48]:
df[['date','month','year']]=df['DT'].str.split('/',expand=True)
df[['date','month','year']]

  date month  year
0    4     3  2022
1    4     2  2022

In [49]:
df.date

0    4
1    4
Name: date, dtype: object

In [50]:
df.month

0    3
1    2
Name: month, dtype: object

In [51]:
df.year

0    2022
1    2022
Name: year, dtype: object

In [52]:
#As well as time also having hour,minute,second

In [55]:
df[['hr','min','sec']]=df['time'].str.split(':',expand=True)
df[['hr','min','sec']]

  hr min sec
0  8  30  21
1  5  30  21

In [56]:
df['hr']

0    8
1    5
Name: hr, dtype: object

In [57]:
df['min']

0    30
1    30
Name: min, dtype: object

In [58]:
df['sec']

0    21
1    21
Name: sec, dtype: object

In [62]:
df=df[['H.No','Street','City','State','Zipcode','date','month','year','hr','min','sec']]
df

,H.No,Street,City,State,Zipcode,date,month,year,hr,min,sec
0,45 rd,kenith street,btm,bangalore,500038,4,3,2022,8,30,21
1,45 rd,street,hitech,Hd,500038,4,2,2022,5,30,21

In [63]:
#we can also split the data in this format.
addr="2-8-41/A/1,AadarshNagar,BankColony,Munaganoor,Hyderabad,Telanagana,501511"
add_s=addr.split(',')
address={
    'H.No':add_s[0],
    'Street':add_s[1],
    'Village':add_s[2],
    'City':add_s[3],
    'State':add_s[4],
    'ZipCode':add_s[5]
    
}
print(address)

{'H.No': '2-8-41/A/1', 'Street': 'AadarshNagar', 'Village': 'BankColony', 'City': 'Munaganoor', 'State': 'Hyderabad', 'ZipCode': 'Telanagana'}